In [1]:
# Import necessary packages
import pandas as pd

In [8]:
# Load the dataset
data = pd.read_csv("student_scores.csv")

In [9]:
# Display the first few rows of the dataset
data.head()

,student_id,first_name,last_name,age,gender,math_score,science_score,english_score
0,1,John,Doe,18,M,85,78,92
1,2,Jane,Smith,17,F,72,88,95
2,3,Mike,Johnson,18,M,65,92,78
3,4,Emily,Williams,16,F,90,68,82
4,5,Chris,Brown,17,M,78,75,88

In [4]:
# Get basic information about the dataset
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   student_id     10 non-null     int64
 1   first_name     10 non-null     object
 2   last_name      10 non-null     object
 3   age            10 non-null     int64
 4   gender         10 non-null     object
 5   math_score     10 non-null     int64
 6   science_score  10 non-null     int64
 7   english_score  10 non-null     int64
dtypes: int64(5), object(3)
memory usage: 768.0+ bytes

In [12]:
data['gender'] = data['gender'].astype('category')

In [15]:
# Calculate summary statistics
data.describe()

       student_id        age  math_score  science_score  english_score
count    10.00000  10.000000    10.00000      10.000000      10.000000
mean      5.50000  17.100000    81.00000      82.300000      87.500000
std       3.02765   0.875595    10.36018       9.452219       6.770032
min       1.00000  16.000000    65.00000      68.000000      77.000000
25%       3.25000  16.250000    72.75000      75.750000      82.750000
50%       5.50000  17.000000    81.50000      83.000000      89.000000
75%       7.75000  18.000000    89.50000      89.500000      92.000000
max      10.00000  18.000000    95.00000      96.000000      96.000000

In [19]:
data.head()

,student_id,first_name,last_name,age,gender,math_score,science_score,english_score
0,1,John,Doe,18,M,85,78,92
1,2,Jane,Smith,17,F,72,88,95
2,3,Mike,Johnson,18,M,65,92,78
3,4,Emily,Williams,16,F,90,68,82
4,5,Chris,Brown,17,M,78,75,88

In [21]:
# Select specific columns
scores = data[['math_score', 'science_score', 'english_score']]
scores.head(10)

   math_score  science_score  english_score
0          85             78             92
1          72             88             95
2          65             92             78
3          90             68             82
4          78             75             88
5          92             82             96
6          70             84             77
7          88             70             90
8          75             90             85
9          95             96             92

In [22]:
# Calculate average scores
average_scores = scores.mean()
print(average_scores)

math_score       81.0
science_score    82.3
english_score    87.5
dtype: float64

In [23]:
data.head(10)

,student_id,first_name,last_name,age,gender,math_score,science_score,english_score
0,1,John,Doe,18,M,85,78,92
1,2,Jane,Smith,17,F,72,88,95
2,3,Mike,Johnson,18,M,65,92,78
3,4,Emily,Williams,16,F,90,68,82
4,5,Chris,Brown,17,M,78,75,88
5,6,Sarah,Jones,18,F,92,82,96
6,7,David,Lee,16,M,70,84,77
7,8,Laura,Miller,17,F,88,70,90
8,9,James,Anderson,16,M,75,90,85
9,10,Olivia,Brown,18,F,95,96,92

In [27]:
# Find the student with the highest total score
data['total_score'] = data['math_score'] + data['science_score'] + data['english_score']
highest_scoring_student = data.loc[data['total_score'].idxmax()]
print(highest_scoring_student)

student_id           10
first_name       Olivia
last_name         Brown
age                  18
gender                F
math_score           95
science_score        96
english_score        92
total_score         283
Name: 9, dtype: object

In [28]:
lowest_scoring_student = data.loc[data['total_score'].idxmin()]
print(lowest_scoring_student)

student_id           7
first_name       David
last_name          Lee
age                 16
gender               M
math_score          70
science_score       84
english_score       77
total_score        231
Name: 6, dtype: object

In [30]:
# Filter data based on conditions
female_students = data[data['gender'] == 'F']
female_students

,student_id,first_name,last_name,age,gender,math_score,science_score,english_score,total_score
1,2,Jane,Smith,17,F,72,88,95,255
3,4,Emily,Williams,16,F,90,68,82,240
5,6,Sarah,Jones,18,F,92,82,96,270
7,8,Laura,Miller,17,F,88,70,90,248
9,10,Olivia,Brown,18,F,95,96,92,283

In [36]:
students = data[data['total_score'] >= 250]
students

,student_id,first_name,last_name,age,gender,math_score,science_score,english_score,total_score
2,3,Mike,Johnson,18,M,65,92,78,235
3,4,Emily,Williams,16,F,90,68,82,240
4,5,Chris,Brown,17,M,78,75,88,241
6,7,David,Lee,16,M,70,84,77,231
7,8,Laura,Miller,17,F,88,70,90,248
8,9,James,Anderson,16,M,75,90,85,250

In [38]:
# Group data by gender and calculate average scores
gender_grouped = data.groupby('gender').mean()
gender_grouped

/tmp/ipykernel_19515/1308135586.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  gender_grouped = data.groupby('gender').mean()

,student_id,age,math_score,science_score,english_score,total_score
gender,,,,,,
F,6.0,17.2,87.4,80.8,91.0,259.2
M,5.0,17.0,74.6,83.8,84.0,242.4

In [39]:
gender_grouped = data.groupby('age').mean()
gender_grouped

/tmp/ipykernel_19515/939163014.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  gender_grouped = data.groupby('age').mean()

     student_id  math_score  science_score  english_score  total_score
age
16     6.666667   78.333333      80.666667      81.333333   240.333333
17     5.000000   79.333333      77.666667      91.000000   248.000000
18     5.000000   84.250000      87.000000      89.500000   260.750000

In [41]:
data

,student_id,first_name,last_name,age,gender,math_score,science_score,english_score,total_score
0,1,John,Doe,18,M,85,78,92,255
1,2,Jane,Smith,17,F,72,88,95,255
2,3,Mike,Johnson,18,M,65,92,78,235
3,4,Emily,Williams,16,F,90,68,82,240
4,5,Chris,Brown,17,M,78,75,88,241
5,6,Sarah,Jones,18,F,92,82,96,270
6,7,David,Lee,16,M,70,84,77,231
7,8,Laura,Miller,17,F,88,70,90,248
8,9,James,Anderson,16,M,75,90,85,250
9,10,Olivia,Brown,18,F,95,96,92,283

In [45]:
# Sort data by a specific column
sorted_data = data.sort_values(by='total_score', ascending=False)
sorted_data.head(5)

,student_id,first_name,last_name,age,gender,math_score,science_score,english_score,total_score
9,10,Olivia,Brown,18,F,95,96,92,283
5,6,Sarah,Jones,18,F,92,82,96,270
0,1,John,Doe,18,M,85,78,92,255
1,2,Jane,Smith,17,F,72,88,95,255
8,9,James,Anderson,16,M,75,90,85,250

In [46]:
sorted_data = data.sort_values(by='total_score', ascending=True)
sorted_data.head(5)

,student_id,first_name,last_name,age,gender,math_score,science_score,english_score,total_score
6,7,David,Lee,16,M,70,84,77,231
2,3,Mike,Johnson,18,M,65,92,78,235
3,4,Emily,Williams,16,F,90,68,82,240
4,5,Chris,Brown,17,M,78,75,88,241
7,8,Laura,Miller,17,F,88,70,90,248

In [47]:
# Save the modified data to a new CSV file
data.to_csv("modified_student_scores.csv", index=False)

In [48]:
df = pd.read_csv('modified_student_scores.csv')
df.head()

,student_id,first_name,last_name,age,gender,math_score,science_score,english_score,total_score
0,1,John,Doe,18,M,85,78,92,255
1,2,Jane,Smith,17,F,72,88,95,255
2,3,Mike,Johnson,18,M,65,92,78,235
3,4,Emily,Williams,16,F,90,68,82,240
4,5,Chris,Brown,17,M,78,75,88,241